// 1. lib/api/api.ts — для створення одного спільного екземпляра axios, 
// з налаштуванням withCredentials: true для підтримки cookies;

// lib/api/api.ts
// API клієнт для взаємодії з бекендом
// Використовує axios для HTTP-запитів
// Налаштований для роботи з обліковими даними (cookies)
// та базовою URL-адресою з змінної оточення
// ----------------------------------------------------------------------------
// Імпорт бібліотеки axios для HTTP-запитів
import axios from "axios";

// Створення екземпляра axios з налаштуваннями
// для роботи з обліковими даними та базовою URL-адресою
// ----------------------------------------------------------------------------
// Експорт налаштованого API клієнта
export const api = axios.create({
    // Дозволяє відправляти облікові дані (cookies) з запитами    
    withCredentials: true,

    // Встановлення базової URL-адреси з змінної оточення
    // NEXT_PUBLIC_API_URL
    // Додає '/api' до кінця базової URL-адреси
    // для спрямування запитів до відповідного маршруту на бекенді
    baseURL: `${process.env.NEXT_PUBLIC_API_URL}/api`,

});
